Examples/tests/AMIPipe/constant/staticGridCloudProperties
transientGridCloudProperties