Examples/tests/AMIPipe/constant/transientGridCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      limestoneCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         false;
    transient       yes;
    calcFrequency   1;

    cellValueSourceCorrection off;
    maxCo           0.3;

    sourceTerms
    {
        resetOnStartup  no;
        schemes
        {
            U           semiImplicit 1;
        }
    }

    interpolationSchemes
    {
        pseudoRho             cell;
        pseudoMu              cell;
        //        U                cellPoint;
        U                cell;
        //        U                     pointMVC;
        //        U         cellPointWallModified;
        staticU   $U;
        rho                   cell;
        mu                    cell;
    }

    integrationSchemes
    {
        //        U               Euler;
        U               analytical;
    }
}

constantProperties
{
    parcelTypeId    2;

    rho0            100000;
}

subModels
{
    particleForces
    {
        sphereDrag;
        //        gravity;
    }

    injectionModels
    {
    }

    dispersionModel none;

    patchInteractionModel standardWallInteraction;

    stochasticCollisionModel none;

    surfaceFilmModel none;

    collisionModel none;

    radiation       off;

    standardWallInteractionCoeffs
    {
        type            rebound;
        e               1;
        mu              0;
    }
    RanzMarshallCoeffs
    {
        BirdCorrection  false;
    }
}


cloudFunctions
{
    // traceParticles {
    //     type traceParticles;
    //     particleIds (
    //         {
    //             origProc 0;
    //             origId 2323;
    //         }
    //         {
    //             origProc 0;
    //             origId 849;
    //         }
    //     );
    // }
    // correctCells {
    //     type correctParticleCell;
    //     //        logCorrected true;
    // }
    patchAuslass
    {
        type            patchPostProcessing;
        maxStoredParcels 10000;
        patches         (
            inlet
            outlet
        );
    }
    patchWall
    {
        type            patchPostProcessing;
        maxStoredParcels 10000;
        patches         (
            cylinder
        );
    }
    patchInterface
    {
        type            patchPostProcessing;
        maxStoredParcels 10000;
        patches         (
            "intersect.*"
        );
    }
    profileHits {
        type cloudMoveStatistics;
        reportHitNr 100;
        reportMoveNr 100;
    }
    removeHitters {
        type eliminateCaughtParcels;
        maximumNumberOfHits 1000;
        minDistanceMove -1;
        clearVelocityOnElimination no;
    }
    outsideParticles {
        type eliminateOutsideParticles;
        eliminatePre false;
        eliminatePost true;
    }
}
