Examples/tests/AMIPipe/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( -0.03 -0.03   0)
    (  0.03 -0.03   0)
    (  0.03  0.03   0)
    ( -0.03  0.03   0)
    ( -0.03 -0.03 0.1)
    (  0.03 -0.03 0.1)
    (  0.03  0.03 0.1)
    ( -0.03  0.03 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (12 12 20) simpleGrading (1 1 1)
    //    hex (0 1 2 3 4 5 6 7) (13 13 21) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    allBoundary
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    inlet {
        type patch;
        faces (
            (0 3 2 1)
        );
    }
    outlet {
        type patch;
        faces (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
