Examples/tests/AMIPipe/system/funkySetLagrangianFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transientGridCloud {
    xScale 1;
    yScale 0;
    #include "transientGridCloudSkeleton"
}
staticGridCloud {
    xScale 0;
    yScale 1;
    #include "transientGridCloudSkeleton"
}
